Repository: elijah-olejnik/note_manager
Catalog: Этап 5/locales/*/LC_MESSAGES/messages.po
Languages: ru

source: Missing required fields in record:
ru: Не найдены требуемые поля в заметке:

source: Data format error in record
ru: Неверный формат данных в заметке:

source: File IO function returned empty list.
ru: Функция чтения файла вернула пустой список.

source: Failed to import notes:
ru: Ошибка импорта заметок:

source: Note with ID
ru: Заметка с ID

source: not found.
ru: не найдена.

source: File
ru: Файл

source: is empty!
ru: пуст!

source: Import from YAML file failed:
ru: Ошибка импорта из файла YAML:

source: Import from JSON file failed:
ru: Ошибка импорта из файла JSON:

source: Export to YAML file failed:
ru: Ошибка экспорта в файл YAML:

source: Export to JSON file failed:
ru: Ошибка экспорта в файл JSON:

source: You're trying to export an empty list.
ru: Вы пытаетесь экспортировать пустой список.

source: The deadline can be only in the future.
ru: Дата дедлайна может быть только в будущем.

source: Not an Enum value:
ru: Не является значением перечисления:

source: A new file is created.
ru: Создан новый файл

source: Can't create a new file:
ru: Ошмбка при попытке создать новый файл:

source: The note list is empty.
ru: Список заметок пуст.

source: NO DEADLINE
ru: НЕТ ДЕДЛАЙНА

source: Edit your note text. To exit and save text press Esc.
ru: Отредактируйте текст Вашей заметки. Для выхода с сохранением нажмите Esc.

source: Welcome to the note manager!
ru: Добро пожаловать в менеджер заметок!

source: Note ID
ru: ID заметки

source: Username
ru: Имя пользователя

source: Title
ru: Заголовок

source: Content
ru: Содержание

source: Status
ru: Статус

source: Created date
ru: Дата создания

source: Deadline date
ru: Срок выполнения

source: Keywords
ru: Ключевые слова

source: Both
ru: Оба

source: Are you sure? yes | no:
ru: Вы уверены? да | нет:

source: No notes to display.
ru: Нет заметок для отображения.

source: No notes found.
ru: Заметки не найдены.

source: Page
ru: Страница

source: total
ru: всего

source: next page
ru: следующая страница

source: previous page
ru: предыдущая страница

source: quit
ru: завершить

source: You are on the last page.
ru: Вы на последней странице.

source: You are on the first page.
ru: Вы на первой странице.

source: Invalid choice.
ru: Выбор некорректен.

source: The correct commands are
ru: Принимаются команды

source: The note created:
ru: Заметка создана:

source: The note chosen:
ru: Заметка выбрана:

source: The note updated:
ru: Заметка обновлена:

source: The note
ru: Заметка

source: deleted
ru: удалена

source: Search
ru: Поиск

source: Search by
ru: Поиск по

source: Show all
ru: Показать все

source: No matches found.
ru: Совпадения не найдены.

source: Choose a note
ru: Выберите заметку

source: Delete a note
ru: Удалить заметку

source: or
ru: или

source: Choose the new note state
ru: Выберите статус заметки

source: Notes display options
ru: Опции отображения заметок

source: Show notes
ru: Показать заметки

source: Sort notes
ru: Сортировка

source: full
ru: полностью

source: shortened
ru: кратко

source: Ascending
ru: По возрастанию

source: descending
ru: по убыванию

source: Note edit menu
ru: Меню редактирования заметки

source: Back to the main menu
ru: Назад в главное меню

source: Main menu
ru: Главное меню

source: Create a note
ru: Создать заметку

source: Edit a note
ru: Редактировать заметку

source: Missing deadline:
ru: Дедлайн просрочен:

source: The deadline is today:
ru: Дедлайн сегодня:

source: The deadline is tomorrow:
ru: Дедлайн завтра:

source: Enter choice:
ru: Введите выбор:

source: Enter a username:
ru: Введите имя пользователя:

source: Enter a title:
ru: Введите заголовок:

source: Enter note deadline (dd-mm-yyyy hh:mm):
ru: Введите дату дедлайна (дд-мм-гггг чч:мм):

source: Enter keywords, separated by
ru: Введите ключевые слова, разделенные символом

source: Enter display options, only 3 supported (e.g. for show note in full sorting by created date ascending enter
ru: Введите опции отображения, только 3 поддерживаются (например, для показа заметок полностью, отсортированных по дате создания, в порядке возрастания, введите
